men100/mtfs/tests/targets/stm32n6570_dk/basic/application/mtfs_target_main.c
static void target_reporter(
    void *opaque, mtfs_test_event_t event, const char *test_name,
    const char *file, int line, const char *message,
    unsigned int checks, unsigned int failures)
{
    (void)opaque;
    if (event == MTFS_TEST_EVENT_BEGIN) {
        tm_printf((UB *)"[TEST] %s: BEGIN\n", (UB *)test_name);
    } else if (event == MTFS_TEST_EVENT_CHECK_FAILED) {
        tm_printf((UB *)"[TEST] %s: FAIL %s:%d: %s\n",
            (UB *)test_name, (UB *)file, line, (UB *)message);
    } else {
        tm_printf((UB *)"[TEST] %s: %s (checks=%u failures=%u)\n",
            (UB *)test_name, failures == 0U ? (UB *)"PASS" : (UB *)"FAIL",
            checks, failures);
    }
}

static void target_media_event(void *opaque, mtfs_media_event_t event,
    mtfs_media_state_t state)
{
    mtfs_stm32n6570_dk_card_detect_diagnostics_t cd;
    mtfs_media_diagnostics_t media_diagnostics;
    (void)opaque;
    if (event == MTFS_MEDIA_EVENT_INSERTED) {
        ++media_inserted_events;
        tm_printf((UB *)"[mtfs] media INSERTED state=%u; application must initialize/register/mount\n",
            (UW)state);
        if (media_application_event_flag_id > 0) {
            (void)tk_set_flg(media_application_event_flag_id,
                MTFS_TARGET_MEDIA_INSERTED);
        }
    } else if (event == MTFS_MEDIA_EVENT_REMOVED) {
        ++media_removed_events;
        tm_printf((UB *)"[mtfs] media REMOVED state=%u; application must stop requests/unmount/unregister\n",
            (UW)state);
        if (media_application_event_flag_id > 0) {
            (void)tk_set_flg(media_application_event_flag_id,
                MTFS_TARGET_MEDIA_REMOVED);
        }
    } else {
        ++media_error_events;
        tm_printf((UB *)"[mtfs] media ERROR state=%u\n", (UW)state);
        if (media_application_event_flag_id > 0) {
            (void)tk_set_flg(media_application_event_flag_id,
                MTFS_TARGET_MEDIA_ERROR);
        }
    }
    mtfs_stm32n6570_dk_get_card_detect_diagnostics(&cd);
    (void)mtfs_media_diagnostics_get(&media_context, &media_diagnostics);
    tm_printf((UB *)"[mtfs] CD raw=%u active=%s irq=%u rise=%u fall=%u debounce=%u/%u events=%u/%u/%u\n",
        cd.raw_level, cd.active_low ? (UB *)"low" : (UB *)"high",
        cd.irq_entries, cd.rising_edges, cd.falling_edges,
        media_diagnostics.debounce_starts,
        media_diagnostics.debounce_rechecks,
        media_inserted_events, media_removed_events, media_error_events);
}

static int target_wait_media_event(UINT expected, const char *operation)
{
    UINT events = 0U;
    ER result = tk_wai_flg(media_application_event_flag_id,
        expected | MTFS_TARGET_MEDIA_ERROR, TWF_ORW | TWF_BITCLR,
        &events, MTFS_TARGET_HOTPLUG_WAIT_MS);
    if ((result < E_OK) || ((events & expected) == 0U)) {
        tm_printf((UB *)"[mtfs] %s wait FAIL tk=%d events=0x%08x\n",
            (UB *)operation, result, events);
        return 0;
    }
    return 1;
}

static int target_check_idma_diagnostics(
    mtfs_test_t *test, mtfs_stm32_sdmmc_context_t *context)
{
    mtfs_stm32_sdmmc_diagnostics_t snapshot;
    const mtfs_stm32_sdmmc_diagnostics_t *diagnostics = &snapshot;

    if (!MTFS_TEST_CHECK(test,
            mtfs_stm32_sdmmc_diagnostics_get(context, &snapshot) == MTFS_OK,
            "typed STM32 SDMMC diagnostics snapshot is available")) {
        return 1;
    }

    if (!context->config.use_idma) {
        return 0;
    }
    (void)MTFS_TEST_CHECK(test, diagnostics->irq_entries > 0U,
        "SDMMC2 IRQ reached the T-Kernel high-level handler");
    (void)MTFS_TEST_CHECK(test, diagnostics->rx_complete_callbacks > 0U,
        "SD Rx complete callback reached");
    (void)MTFS_TEST_CHECK(test, diagnostics->tx_complete_callbacks > 0U,
        "SD Tx complete callback reached");
    (void)MTFS_TEST_CHECK(test, diagnostics->error_callbacks == 0U,
        "SD error callback count remains zero");
    (void)MTFS_TEST_CHECK(test, diagnostics->read_single_starts > 0U,
        "single-block IDMA read started");
    (void)MTFS_TEST_CHECK(test, diagnostics->read_multi_starts > 0U,
        "multi-block IDMA read started");
    (void)MTFS_TEST_CHECK(test, diagnostics->write_multi_starts > 0U,
        "multi-block IDMA write started through FatFs");
    (void)MTFS_TEST_CHECK(test, diagnostics->read_max_blocks >= 2U,
        "IDMA read maximum block count is at least two");
    (void)MTFS_TEST_CHECK(test, diagnostics->write_max_blocks >= 2U,
        "IDMA write maximum block count is at least two");
    return test->failures == 0U ? 0 : 1;
}

static void target_print_diagnostics(
    mtfs_stm32_sdmmc_context_t *context)
{
    mtfs_stm32_sdmmc_diagnostics_t port_snapshot;
    mtfs_block_diagnostics_t common;
    mtfs_media_diagnostics_t media;
    const mtfs_stm32_sdmmc_diagnostics_t *diagnostics = &port_snapshot;
    if (mtfs_stm32_sdmmc_diagnostics_get(context, &port_snapshot) != MTFS_OK) {
        tm_printf((UB *)"[diag] STM32 SDMMC snapshot unavailable\n");
        return;
    }
    if (mtfs_block_diagnostics_get(
            mtfs_stm32_sdmmc_block_device(context), &common) == MTFS_OK) {
        tm_printf((UB *)"[diag] common v=%u size=%u epoch=%u op=%u error=%d status=0x%08x geometry=%u/0x%08x%08x/%u\n",
            common.api_version, common.struct_size, common.reset_epoch,
            common.last_operation, common.last_error, common.status,
            common.sector_size, (UW)(common.sector_count >> 32U),
            (UW)common.sector_count, common.erase_block_size);
        tm_printf((UB *)"[diag] common calls init=%u read=%u/%u/%u write=%u/%u/%u sync=%u/%u/%u sectors=%u/%u/%u/%u\n",
            common.initialize_calls, common.read_calls, common.read_successes,
            common.read_failures, common.write_calls, common.write_successes,
            common.write_failures, common.sync_calls, common.sync_successes,
            common.sync_failures, common.read_sectors_requested,
            common.read_sectors_completed, common.write_sectors_requested,
            common.write_sectors_completed);
    }
    if (mtfs_media_diagnostics_get(&media_context, &media) == MTFS_OK) {
        tm_printf((UB *)"[diag] media v=%u epoch=%u state=%u present=%u sequence=%u generation=%u irq=%u manual=%u poll=%u debounce=%u/%u events=%u/%u/%u\n",
            media.api_version, media.reset_epoch, media.state,
            media.stable_present, media.notification_sequence,
            media.media_generation, media.irq_notifications,
            media.manual_notifications, media.poll_checks,
            media.debounce_starts, media.debounce_rechecks,
            media.inserted_events, media.removed_events, media.error_events);
    }
    tm_printf((UB *)"[diag] st v=%u size=%u epoch=%u validity=0x%08x mode=%s state=%u/%u/%u geometry=%u/0x%08x%08x/%u bounce=%u line=%u aligned=%u\n",
        diagnostics->api_version,
        diagnostics->struct_size,
        diagnostics->reset_epoch,
        diagnostics->validity_mask,
        diagnostics->use_idma ? (UB *)"IDMA+IRQ" : (UB *)"polling",
        diagnostics->initialized,
        diagnostics->hal_initialized,
        diagnostics->transfer_active,
        diagnostics->sector_size,
        (UW)(diagnostics->sector_count >> 32U),
        (UW)diagnostics->sector_count,
        diagnostics->erase_block_size,
        diagnostics->bounce_buffer_size,
        diagnostics->cache_line_size,
        ((uintptr_t)context->bounce_buffer &
            (diagnostics->cache_line_size - 1U)) == 0U);
    tm_printf((UB *)"[mtfs] irq=%u rx=%u tx=%u err=%u abort=%u timeout=%u/%u\n",
        diagnostics->irq_entries,
        diagnostics->rx_complete_callbacks,
        diagnostics->tx_complete_callbacks,
        diagnostics->error_callbacks,
        diagnostics->aborts,
        diagnostics->completion_timeouts,
        diagnostics->card_state_timeouts);
    tm_printf((UB *)"[mtfs] media removal hints=%u wait wakeups=%u\n",
        diagnostics->media_removal_notifications,
        diagnostics->media_wait_wakeups);
    tm_printf((UB *)"[mtfs] read single=%u multi=%u max=%u; write single=%u multi=%u max=%u\n",
        diagnostics->read_single_starts,
        diagnostics->read_multi_starts,
        diagnostics->read_max_blocks,
        diagnostics->write_single_starts,
        diagnostics->write_multi_starts,
        diagnostics->write_max_blocks);
    tm_printf((UB *)"[mtfs] last mtfs=%d tk=%d hal=%u/0x%08x transfer-hal=0x%08x clkcr(snapshot)=0x%08x hwfc=%u div=%u\n",
        diagnostics->last_error,
        diagnostics->last_kernel_error,
        diagnostics->last_hal_status,
        diagnostics->last_hal_error,
        diagnostics->transfer_hal_error,
        diagnostics->last_clkcr,
        (diagnostics->last_clkcr & SDMMC_CLKCR_HWFC_EN) != 0U,
        diagnostics->last_clkcr & SDMMC_CLKCR_CLKDIV);
}

#if MTFS_TARGET_COMMAND_CONSOLE_ACTIVE
static int target_common_counters_are_clear(
    const mtfs_block_diagnostics_t *diagnostics)
{
    return (diagnostics->initialize_calls == 0U) &&
        (diagnostics->initialize_successes == 0U) &&
        (diagnostics->initialize_failures == 0U) &&
        (diagnostics->status_calls == 0U) &&
        (diagnostics->status_failures == 0U) &&
        (diagnostics->read_calls == 0U) &&
        (diagnostics->read_successes == 0U) &&
        (diagnostics->read_failures == 0U) &&
        (diagnostics->write_calls == 0U) &&
        (diagnostics->write_successes == 0U) &&
        (diagnostics->write_failures == 0U) &&
        (diagnostics->sync_calls == 0U) &&
        (diagnostics->sync_successes == 0U) &&
        (diagnostics->sync_failures == 0U) &&
        (diagnostics->geometry_calls == 0U) &&
        (diagnostics->geometry_failures == 0U) &&
        (diagnostics->trim_calls == 0U) &&
        (diagnostics->trim_successes == 0U) &&
        (diagnostics->trim_failures == 0U) &&
        (diagnostics->read_sectors_requested == 0U) &&
        (diagnostics->read_sectors_completed == 0U) &&
        (diagnostics->write_sectors_requested == 0U) &&
        (diagnostics->write_sectors_completed == 0U) &&
        (diagnostics->io_errors == 0U) &&
        (diagnostics->not_ready_errors == 0U) &&
        (diagnostics->no_media_errors == 0U) &&
        (diagnostics->write_protected_errors == 0U) &&
        (diagnostics->out_of_range_errors == 0U) &&
        (diagnostics->timeout_errors == 0U) &&
        (diagnostics->other_errors == 0U);
}

static int target_media_counters_are_clear(
    const mtfs_media_diagnostics_t *diagnostics)
{
    return (diagnostics->irq_notifications == 0U) &&
        (diagnostics->manual_notifications == 0U) &&
        (diagnostics->poll_checks == 0U) &&
        (diagnostics->debounce_starts == 0U) &&
        (diagnostics->debounce_rechecks == 0U) &&
        (diagnostics->inserted_events == 0U) &&
        (diagnostics->removed_events == 0U) &&
        (diagnostics->error_events == 0U);
}

static int target_st_counters_are_clear(
    const mtfs_stm32_sdmmc_diagnostics_t *diagnostics)
{
    return (diagnostics->irq_entries == 0U) &&
        (diagnostics->rx_complete_callbacks == 0U) &&
        (diagnostics->tx_complete_callbacks == 0U) &&
        (diagnostics->error_callbacks == 0U) &&
        (diagnostics->read_single_starts == 0U) &&
        (diagnostics->read_multi_starts == 0U) &&
        (diagnostics->write_single_starts == 0U) &&
        (diagnostics->write_multi_starts == 0U) &&
        (diagnostics->read_max_blocks == 0U) &&
        (diagnostics->write_max_blocks == 0U) &&
        (diagnostics->aborts == 0U) &&
        (diagnostics->media_removal_notifications == 0U) &&
        (diagnostics->media_wait_wakeups == 0U) &&
        (diagnostics->completion_timeouts == 0U) &&
        (diagnostics->card_state_timeouts == 0U);
}

static int target_run_diagnostics_reset_test(void)
{
    mtfs_stm32_sdmmc_config_t config;
    mtfs_block_device_t *device = NULL;
    mtfs_block_geometry_t geometry;
    mtfs_block_status_t status = 0U;
    mtfs_block_diagnostics_t common_before;
    mtfs_block_diagnostics_t common_reset;
    mtfs_block_diagnostics_t common_after;
    mtfs_media_diagnostics_t media_before;
    mtfs_media_diagnostics_t media_reset;
    mtfs_media_diagnostics_t media_after;
    mtfs_stm32_sdmmc_diagnostics_t port_before;
    mtfs_stm32_sdmmc_diagnostics_t port_reset;
    mtfs_stm32_sdmmc_diagnostics_t port_after;
    mtfs_test_t test;
    mtfs_error_t error;
    int registered = 0;
    int context_ready = 0;
    int media_ready = 0;
    int failure;

    mtfs_test_begin(&test, "diagnostics_reset_active_context",
        target_reporter, NULL);
    mtfs_stm32n6570_dk_sdmmc_config(&config);
    error = mtfs_stm32_sdmmc_context_init(&sd_context, &config);
    if (!MTFS_TEST_CHECK(&test, error == MTFS_OK,
            "ST context initialization succeeds")) goto cleanup;
    context_ready = 1;

