men100/mtfs/tests/targets/stm32n6570_dk/basic/application/mtfs_target_main.c
    if ((mtfs_time_get_status(&rtc_status) != MTFS_OK) ||
        (rtc_status != MTFS_TIME_STATUS_VALID)) {
        tm_printf((UB *)"[mtfs] FAT timestamp command FAIL: RTC state=%u\n",
            (UW)rtc_status);
        return 1;
    }
    mtfs_stm32n6570_dk_sdmmc_config(&config);
    error = mtfs_stm32_sdmmc_context_init(&sd_context, &config);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] timestamp context init FAIL: %d\n", error);
        goto cleanup;
    }
    context_ready = 1;
    error = mtfs_stm32n6570_dk_card_detect_start(&media_context,
        &media_service, &sd_context, target_media_event, NULL);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] timestamp card detect start FAIL: %d\n",
            error);
        goto cleanup;
    }
    media_ready = 1;
    device = mtfs_stm32_sdmmc_block_device(&sd_context);
    error = mtfs_block_initialize(device);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] timestamp SD init FAIL: %d\n", error);
        goto cleanup;
    }
    error = mtfs_block_registry_register(0U, device);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] timestamp pdrv 0 register FAIL: %d\n",
            error);
        goto cleanup;
    }
    registered = 1;

    mtfs_test_begin(&test, "fatfs_timestamp", target_reporter, NULL);
    case_result = test_fatfs_timestamp(&test, "0:", &timestamp_result);
    test_failure = (mtfs_test_finish(&test) != 0) || (case_result != 0);
    if (timestamp_result.fat_file != 0U) {
        target_print_timestamp_datetime(
            "RTC before : ", &timestamp_result.rtc_before);
        target_print_timestamp_datetime(
            "File time  : ", &timestamp_result.file_time);
        target_print_timestamp_datetime(
            "RTC after  : ", &timestamp_result.rtc_after);
        tm_printf((UB *)"FAT raw    : 0x%08x\n",
            timestamp_result.fat_file);
    }

cleanup:
    if (media_ready &&
        (mtfs_stm32n6570_dk_card_detect_stop() != MTFS_OK)) {
        tm_printf((UB *)"[mtfs] timestamp card detect cleanup FAIL\n");
        test_failure = 1;
    }
    if (registered && (mtfs_block_registry_unregister(0U) != MTFS_OK)) {
        tm_printf((UB *)"[mtfs] timestamp registry cleanup FAIL\n");
        test_failure = 1;
    }
    if (context_ready &&
        (mtfs_stm32_sdmmc_context_deinit(&sd_context) != MTFS_OK)) {
        tm_printf((UB *)"[mtfs] timestamp context cleanup FAIL\n");
        test_failure = 1;
    }
    if (context_ready && test_failure) {
        target_print_diagnostics(&sd_context);
    }
    tm_printf((UB *)"[mtfs] FAT timestamp command %s\n",
        test_failure ? (UB *)"FAIL" : (UB *)"PASS");
    return test_failure ? 1 : 0;
}

static int target_console_command(void *opaque, const char *line)
{
    static const char command[] = "test-roundtrip";
    unsigned int rounds = MTFS_STM32N6570_TEST_ROUNDS;
    size_t offset = sizeof(command) - 1U;
    int parse_result = 0;

    (void)opaque;
    if (strcmp(line, command) == 0) {
        parse_result = 1;
    } else if ((strncmp(line, command, offset) == 0) &&
        (line[offset] == ' ')) {
        const char *argument = line + offset + 1U;
        rounds = 0U;
        parse_result = -1;
        while ((*argument >= '0') && (*argument <= '9')) {
            unsigned int digit = (unsigned int)(*argument++ - '0');
            if (rounds > ((MTFS_TARGET_TEST_ROUNDS_MAX - digit) / 10U)) {
                rounds = MTFS_TARGET_TEST_ROUNDS_MAX + 1U;
                break;
            }
            rounds = rounds * 10U + digit;
            parse_result = 1;
        }
        if ((*argument != '\0') || (rounds == 0U) ||
            (rounds > MTFS_TARGET_TEST_ROUNDS_MAX)) {
            parse_result = -1;
        }
    }
    if (parse_result != 0) {
        if (parse_result < 0) {
            tm_printf((UB *)"[mtfs] usage: test-roundtrip [1..%u] (default=%u)\n",
                MTFS_TARGET_TEST_ROUNDS_MAX, MTFS_STM32N6570_TEST_ROUNDS);
        } else {
            (void)target_run_storage_test(rounds, 0);
        }
        return 1;
    }
    if (strcmp(line, "test-hotplug") == 0) {
        (void)target_run_storage_test(1U, 1);
        return 1;
    }
    if (mtfs_stm32n6570_crypto_command(line)) {
        return 1;
    }
    if (strcmp(line, "test-fatfs-time") == 0) {
        (void)target_run_fatfs_time_test();
        return 1;
    }
    if (strcmp(line, "bench-info") == 0) {
        (void)target_run_benchmark(MTFS_BENCHMARK_PROFILE_NORMAL, 1);
        return 1;
    }
    if (strcmp(line, "bench-smoke") == 0) {
        (void)target_run_benchmark(MTFS_BENCHMARK_PROFILE_SMOKE, 0);
        return 1;
    }
    if (strcmp(line, "bench-normal") == 0) {
        (void)target_run_benchmark(MTFS_BENCHMARK_PROFILE_NORMAL, 0);
        return 1;
    }
    if (strcmp(line, "test-diagnostics-reset") == 0) {
        (void)target_run_diagnostics_reset_test();
        return 1;
    }
    if (strcmp(line, "diag") == 0) {
        target_print_diagnostics(&sd_context);
        return 1;
    }
    if (strcmp(line, "diag-reset") == 0) {
        mtfs_error_t common = mtfs_block_diagnostics_reset(
            mtfs_stm32_sdmmc_block_device(&sd_context));
        mtfs_error_t media = mtfs_media_diagnostics_reset(&media_context);
        mtfs_error_t port = mtfs_stm32_sdmmc_diagnostics_reset(&sd_context);
        tm_printf((UB *)"[diag] reset common=%d media=%d st=%d (I/O/media state unchanged)\n",
            common, media, port);
        return 1;
    }
    if (strcmp(line, "diag-help") == 0) {
        tm_printf((UB *)"[diag] diag reads cached snapshots from the last storage command without media I/O; multi-round counters are cumulative and live state is inactive after cleanup; diag-reset clears counters and advances reset epochs only\n");
        return 1;
    }
    return 0;
}
#endif

static int target_run_storage_test(unsigned int rounds, int hotplug)
{
    mtfs_stm32_sdmmc_config_t config;
    mtfs_stm32n6570_dk_rif_diagnostics_t rif;
    mtfs_block_device_t *device = NULL;
    mtfs_error_t error = MTFS_OK;
    unsigned int round;
    int registered = 0;
    int context_ready = 0;
    int media_ready = 0;
    int overall_failure = 0;
    T_CFLG media_flag_config = {
        .flgatr = TA_TFIFO,
        .iflgptn = 0U
    };

