men100/mtfs/tests/targets/stm32n6570_dk/basic/application/mtfs_target_main.c
    media_inserted_events = 0U;
    media_removed_events = 0U;
    media_error_events = 0U;
    media_reinitialize_count = 0U;
    mtfs_stm32n6570_dk_sdmmc_config(&config);
    if (hotplug) {
        media_application_event_flag_id = tk_cre_flg(&media_flag_config);
        if (media_application_event_flag_id <= 0) {
            tm_printf((UB *)"[mtfs] application media event flag create FAIL: %d\n",
                media_application_event_flag_id);
            media_application_event_flag_id = 0;
            return 1;
        }
    }
    mtfs_stm32n6570_dk_get_rif_diagnostics(&rif);
    tm_printf((UB *)"\n[mtfs] STM32N6570-DK storage test: profile=%s rounds=%u path=%s hotplug=%s LFN=%u max=%u codepage=%u\n",
        (UB *)MTFS_STM32N6570_TEST_PROFILE_NAME,
        rounds,
        config.use_idma ? (UB *)"IDMA+IRQ" : (UB *)"polling fallback",
        hotplug ? (UB *)"on" : (UB *)"off",
        FF_USE_LFN, FF_MAX_LFN, FF_CODE_PAGE);
    tm_printf((UB *)"[mtfs] cache I=%s D=%s CCR=0x%08x\n",
        (SCB->CCR & SCB_CCR_IC_Msk) ? (UB *)"enabled" : (UB *)"disabled",
        (SCB->CCR & SCB_CCR_DC_Msk) ? (UB *)"enabled" : (UB *)"disabled",
        SCB->CCR);
    tm_printf((UB *)"[mtfs] RIF ready=%u master[3]=0x%08x sec=0x%08x priv=0x%08x\n",
        rif.ready, rif.master_attribute, rif.slave_secure,
        rif.slave_privileged);
    if (((SCB->CCR & (SCB_CCR_IC_Msk | SCB_CCR_DC_Msk)) !=
            (SCB_CCR_IC_Msk | SCB_CCR_DC_Msk)) ||
        (config.use_idma && !rif.ready)) {
        tm_printf((UB *)"[mtfs] platform precondition FAIL\n");
        overall_failure = 1;
    }

    error = mtfs_stm32_sdmmc_context_init(&sd_context, &config);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] context init FAIL mtfs=%d tk=%d hal=%u/0x%08x\n",
            error, sd_context.last_kernel_error,
            sd_context.last_hal_status, sd_context.last_hal_error);
        overall_failure = 1;
        goto test_done;
    }
    context_ready = 1;
    error = mtfs_stm32n6570_dk_card_detect_start(&media_context,
        &media_service, &sd_context, target_media_event, NULL);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] card detect start FAIL mtfs=%d tk=%d\n",
            error, media_service.last_kernel_error);
        overall_failure = 1;
        goto test_done;
    }
    media_ready = 1;
    device = mtfs_stm32_sdmmc_block_device(&sd_context);
    tm_printf((UB *)"[mtfs] context=%p bounce=%p size=%u align32=%u cd-debounce=%u ms\n",
        &sd_context, sd_context.bounce_buffer,
        (UW)sizeof(sd_context.bounce_buffer),
        ((uintptr_t)sd_context.bounce_buffer & 31U) == 0U,
        media_context.config.debounce_ms);

    if (hotplug && !mtfs_media_is_present(&media_context)) {
        mtfs_block_status_t absent_status = 0U;
        mtfs_error_t absent_error = mtfs_block_status(device, &absent_status);
        if ((absent_error != MTFS_ERROR_NO_MEDIA) ||
            ((absent_status & MTFS_BLOCK_STATUS_MEDIA_PRESENT) != 0U)) {
            tm_printf((UB *)"[mtfs] initial ABSENT status FAIL: %d/0x%08x\n",
                absent_error, absent_status);
            overall_failure = 1;
            goto test_done;
        }
        tm_printf((UB *)"[mtfs] initial ABSENT status PASS: mtfs=%d flags=0x%08x\n",
            absent_error, absent_status);
        tm_printf((UB *)"[mtfs] ACTION REQUIRED: INSERT card now; waiting up to %u ms\n",
            MTFS_TARGET_HOTPLUG_WAIT_MS);
        if (!target_wait_media_event(MTFS_TARGET_MEDIA_INSERTED,
                "initial INSERTED")) {
            overall_failure = 1;
            goto test_done;
        }
    }

    error = mtfs_block_initialize(device);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] SD init FAIL mtfs=%d tk=%d hal=%u/0x%08x\n",
            error, sd_context.last_kernel_error,
            sd_context.last_hal_status, sd_context.last_hal_error);
        target_print_diagnostics(&sd_context);
        overall_failure = 1;
        goto test_done;
    }
    ++media_reinitialize_count;
    error = mtfs_block_registry_register(0U, device);
    if (error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] pdrv 0 register FAIL: %d\n", error);
        overall_failure = 1;
        goto test_done;
    }
    registered = 1;

    for (round = 1U; round <= rounds; ++round) {
        mtfs_block_geometry_t geometry;
        mtfs_test_t test;
        int case_result;
        int round_failure = 0;

        tm_printf((UB *)"[mtfs] round %u/%u BEGIN\n",
            round, rounds);

        error = mtfs_block_get_geometry(device, &geometry);
        if (error != MTFS_OK) {
            tm_printf((UB *)"[mtfs] geometry FAIL: %d\n", error);
            round_failure = 1;
            goto round_done;
        }
        tm_printf((UB *)"[mtfs] geometry sectors=%u size=%u erase=%u\n",
            (UW)geometry.sector_count, geometry.sector_size,
            geometry.erase_block_size);
        error = mtfs_block_read(device, sector_zero_single, 0U, 1U);
        if (error == MTFS_OK) {
            error = mtfs_block_read(device, sector_zero_multi, 0U, 2U);
        }
        if ((error != MTFS_OK) ||
            (memcmp(sector_zero_single, sector_zero_multi,
                sizeof(sector_zero_single)) != 0)) {
            tm_printf((UB *)"[mtfs] raw read/compare FAIL: %d\n", error);
            target_print_diagnostics(&sd_context);
            round_failure = 1;
            goto round_done;
        }
        tm_printf((UB *)"[mtfs] raw read PASS signature=%02x%02x (%s)\n",
            sector_zero_single[510], sector_zero_single[511],
            (sector_zero_single[510] == 0x55U &&
                sector_zero_single[511] == 0xAAU)
                ? (UB *)"present" : (UB *)"not required");

        mtfs_test_begin(&test, "fatfs_roundtrip", target_reporter, NULL);
        case_result = test_fatfs_roundtrip(&test, "0:");
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            target_print_diagnostics(&sd_context);
            round_failure = 1;
        }

        mtfs_test_begin(&test, "fatfs_lfn", target_reporter, NULL);
        case_result = test_fatfs_lfn(&test, "0:");
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            target_print_diagnostics(&sd_context);
            round_failure = 1;
        }

        mtfs_test_begin(&test, "fatfs_concurrent_microtkernel",
            target_reporter, NULL);
        case_result = mtfs_target_run_concurrent(&test, "0:", round);
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            target_print_diagnostics(&sd_context);
            round_failure = 1;
        }

        mtfs_test_begin(&test, "sdmmc_idma_diagnostics",
            target_reporter, NULL);
        case_result = target_check_idma_diagnostics(&test, &sd_context);
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            round_failure = 1;
        }
        target_print_diagnostics(&sd_context);

        if (hotplug) {
        tm_printf((UB *)"[mtfs] ACTION REQUIRED: REMOVE card now; I/O is idle and files are closed/synced; waiting up to %u ms\n",
            MTFS_TARGET_HOTPLUG_WAIT_MS);
        if (!target_wait_media_event(MTFS_TARGET_MEDIA_REMOVED, "REMOVED")) {
            round_failure = 1;
            goto round_done;
        }
        (void)f_mount(NULL, "0:", 0U);
        {
            mtfs_block_status_t status = 0U;
            mtfs_error_t status_error = mtfs_block_status(device, &status);
            mtfs_error_t read_error = mtfs_block_read(
                device, sector_zero_single, 0U, 1U);
            if ((status_error != MTFS_ERROR_NO_MEDIA) ||
                ((status & MTFS_BLOCK_STATUS_MEDIA_PRESENT) != 0U) ||
                (read_error != MTFS_ERROR_NO_MEDIA)) {
                tm_printf((UB *)"[mtfs] removal contract FAIL status=%d/0x%08x read=%d\n",
                    status_error, status, read_error);
                round_failure = 1;
                goto round_done;
            }
        }
        if (mtfs_block_registry_unregister(0U) != MTFS_OK) {
            tm_printf((UB *)"[mtfs] removal unregister FAIL\n");
            round_failure = 1;
            goto round_done;
        }
        registered = 0;
        tm_printf((UB *)"[mtfs] HOTPLUG: removal contract PASS\n");
        tm_printf((UB *)"[mtfs] ACTION REQUIRED: REINSERT card now; waiting up to %u ms\n",
            MTFS_TARGET_HOTPLUG_WAIT_MS);
        if (!target_wait_media_event(MTFS_TARGET_MEDIA_INSERTED, "re-INSERTED")) {
            round_failure = 1;
            goto round_done;
        }
        error = mtfs_block_initialize(device);
        if ((error != MTFS_OK) ||
            (mtfs_block_registry_register(0U, device) != MTFS_OK)) {
            tm_printf((UB *)"[mtfs] reinitialize/register FAIL: %d\n", error);
            round_failure = 1;
            goto round_done;
        }
        ++media_reinitialize_count;
        registered = 1;
        mtfs_test_begin(&test, "fatfs_roundtrip_after_reinsert",
            target_reporter, NULL);
        case_result = test_fatfs_roundtrip(&test, "0:");
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            round_failure = 1;
        }
        mtfs_test_begin(&test, "fatfs_lfn_after_reinsert",
            target_reporter, NULL);
        case_result = test_fatfs_lfn(&test, "0:");
        if ((mtfs_test_finish(&test) != 0) || (case_result != 0)) {
            round_failure = 1;
        }
        }

round_done:
        tm_printf((UB *)"[mtfs] round %u/%u %s\n", round,
            rounds,
            round_failure ? (UB *)"FAIL" : (UB *)"PASS");
        if (round_failure) {
            overall_failure = 1;
        }
    }

