men100/mtfs/tests/targets/stm32n6570_dk/basic/application/mtfs_target_main.c
test_done:
    if (media_ready) {
        mtfs_stm32n6570_dk_card_detect_diagnostics_t cd;
        mtfs_stm32n6570_dk_get_card_detect_diagnostics(&cd);
        tm_printf((UB *)"[mtfs] CD raw=%u active=%s irq=%u rise=%u fall=%u inserted=%u removed=%u error=%u state=%u reinit=%u\n",
            cd.raw_level, cd.active_low ? (UB *)"low" : (UB *)"high",
            cd.irq_entries, cd.rising_edges, cd.falling_edges,
            media_inserted_events, media_removed_events,
            media_error_events, (UW)mtfs_media_state(&media_context),
            media_reinitialize_count);
        if (mtfs_stm32n6570_dk_card_detect_stop() != MTFS_OK) {
            tm_printf((UB *)"[mtfs] card detect cleanup FAIL tk=%d task=%d flag=%d\n",
                media_service.last_kernel_error,
                media_service.task_id, media_service.event_flag_id);
            overall_failure = 1;
        }
    }
    if (registered && (mtfs_block_registry_unregister(0U) != MTFS_OK)) {
        tm_printf((UB *)"[mtfs] registry cleanup FAIL\n");
        overall_failure = 1;
    }
    if (context_ready) {
        error = mtfs_stm32_sdmmc_context_deinit(&sd_context);
        if (error != MTFS_OK) {
            tm_printf((UB *)"[mtfs] context cleanup FAIL: %d\n", error);
            overall_failure = 1;
        }
    }
    if (media_application_event_flag_id > 0) {
        (void)tk_del_flg(media_application_event_flag_id);
        media_application_event_flag_id = 0;
    }
    tm_printf((UB *)"[mtfs] storage command %s\n",
        overall_failure ? (UB *)"FAIL" : (UB *)"PASS");
    return overall_failure;
}

static void target_coordinator(INT start_code, void *opaque)
{
#if !MTFS_FF_FS_NORTC
    mtfs_error_t rtc_error;
    T_CMTX rtc_mutex = {
        .mtxatr = TA_INHERIT
    };
#endif

    (void)start_code;
    (void)opaque;
#if !MTFS_FF_FS_NORTC
    rtc_mutex_id = tk_cre_mtx(&rtc_mutex);
    if (rtc_mutex_id <= 0) {
        tm_printf((UB *)"[mtfs] RTC mutex create FAIL: %d\n", rtc_mutex_id);
        tk_exd_tsk();
    }
    rtc_error = mtfs_stm32_rtc_init(
        &rtc_context, target_rtc_lock, target_rtc_unlock, &rtc_mutex_id);
    if (rtc_error == MTFS_OK) {
        rtc_error = mtfs_time_provider_register(
            mtfs_stm32_rtc_provider(&rtc_context));
    }
    if (rtc_error != MTFS_OK) {
        tm_printf((UB *)"[mtfs] RTC provider init FAIL: %d reset=0x%08x\n",
            rtc_error, rtc_context.reset_flags_at_init);
    } else {
        mtfs_time_status_t rtc_status;
        (void)mtfs_time_get_status(&rtc_status);
        tm_printf((UB *)"[mtfs] RTC provider state=%u source=LSI local-time reset=0x%08x\n",
            (UW)rtc_status, rtc_context.reset_flags_at_init);
    }
#endif
#if MTFS_TARGET_COMMAND_CONSOLE_ACTIVE
    tm_printf((UB *)"[mtfs] command console ready\n");
    target_command_console();
#else
    tm_printf((UB *)"[mtfs] command console disabled; coordinator stopped\n");
#endif
    tk_exd_tsk();
}

EXPORT INT usermain(void)
{
    T_CTSK coordinator = {
        .tskatr = TA_HLNG | TA_RNG3,
        .task = target_coordinator,
        .itskpri = 9,
        .stksz = 16U * 1024U
    };
    ID task_id = tk_cre_tsk(&coordinator);

    if (task_id <= 0) {
        tm_printf((UB *)"[mtfs] coordinator create FAIL: %d\n", task_id);
        goto park;
    }
    if (tk_sta_tsk(task_id, 0) < E_OK) {
        tm_printf((UB *)"[mtfs] coordinator start FAIL\n");
        (void)tk_del_tsk(task_id);
    }
park:
    for (;;) {
        (void)tk_slp_tsk(TMO_FEVR);
    }
}
